app/Controllers/Super/UnitsController.php

SELECT *
FROM `units`
---
    public function index()
    {
        $data =   [
            'title' => 'Unidades',
            'units' => model(UnitModel::class)->findAll(),
        ];