app/Models/UnitModel.php

SELECT *
FROM `units`
WHERE `units`.`id` = 3
---
    public function findOrFail(int|string $id) : object {
        $row = $this->find($id);