app/Libraries/UnitService.php

SELECT *
FROM `units`
ORDER BY `name` ASC
---
    public function renderUnits(): string
    {

        $units = model(UnitModel::class)->orderBy('name', 'ASC')->findAll();